app/controllers/articles_controller.rb

SELECT "articles".* FROM "articles" ORDER BY "articles"."created_at" DESC LIMIT $1  [["LIMIT", 3]]
SELECT "articles".* FROM "articles" WHERE (id NOT IN(14,13,11)) ORDER BY "articles"."created_at" DESC LIMIT $1 OFFSET $2  [["LIMIT", 2], ["OFFSET", 0]]
SELECT COUNT(*) FROM "articles" WHERE (id NOT IN(19,18,17))
---
  def index
    @highlights = Article.desc_order.first(3)

    current_page = (params[:page] || 1).to_i

    if @highlights.present?
      highlights_ids = @highlights.pluck(:id).join(',')
      @articles = Article.without_highlights(highlights_ids)
                         .desc_order
                         .page(current_page)